{
  "basics": {
    "name": "Warren Wright",
    "label": "Director of Software Engineering",
    "picture": "",
    "email": "warren@thewrightangle.com",
    "summary": "Bringing 14 years of experience in hiring, managing, and directing software teams, with a unique ability to establish collaborative and high-performance environments, among both on-site and remote Agile teams, while developing technical leadership from within.",
    "location": {
      "address": "",
      "postalCode": "80116",
      "city": "Franktown",
      "countryCode": "US",
      "region": "Colorado"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "wrightling",
        "url": ""
      }
    ]
  },
  "work": [
    {
      "company": "Stella & Dot Family of Brands",
      "position": "Director of Software Engineering",
      "startDate": "2014-09-01",
      "endDate": "2018-01-01",
      "summary": "Built and directed three agile teams responsible for launching new brands and extending Stella & Dot's microservice-based architecture.",
      "highlights": [
        "Directly managed engineers while growing strong technical leads for each team.",
        "Led architecture and design sessions, and stayed close to Team Leads and to project milestones from inception to postproduction.",
        "Promoted an environment of constant collaboration, taking seriously the spirit of Agile (a card, a conversation, a confirmation).",
        "Drove architecture discussions, and helped plan major shifts in the company's technical direction",
        "Directed a team that built multi-brand capability into an evolving, Rails-based microservice platform, and successfully launched everskin.com, the second on the platform and third brand in the Stella & Dot Family of Brands, which now exceeds $14MM annual revenue.",
        "As Council member, provided technical leadership while overseeing the migration of the flagship Stella & Dot business onto the more robust microservice platform - which would nearly double the platform's order volume and revenue for the year in just the final quarter.",
        "Modernized the software delivery cycle by partnering with Principal Engineers to move Stella & Dot towards continuous deployment, using Docker for dynamically generated, full-stack QA environments, establishing a largely automated daily Deploy Train process, and simplifying the Git workflow for all teams.",
        "Led major platform-wide implementations affecting all three lines of business, including Backordering, which saved over $350K in sales in its first year, and Subscription billing, which added over $5MM in revenue for 2017."
      ]
    },
    {
      "company": "Next Wave Logistics",
      "position": "Application Director",
      "startDate": "2009-02-01",
      "endDate": "2014-07-01",
      "summary": "Software Engineering director responsible for leading fully remote project teams to deliver full-stack applications for Next Wave’s largest client.",
      "highlights": [
        "Spearheaded the implementation of Agile practices at Next Wave, including involvement as a Scrum Master in a fully remote Scrum team, where we spent over a year developing Next Wave’s key product initiative.",
        "Hired and led a mobile development team through creation of two different e-commerce iOS and Android apps.",
        "Worked directly with Next Wave’s largest client to gather and document user stories for new projects and to see those projects through from requirements to deployment."
      ]
    },
    {
      "company": "JP Morgan FCS",
      "position": "Senior Software Engineer",
      "startDate": "2008-01-01",
      "endDate": "2009-01-01",
      "summary": "Automated key portions of a process related to the core business of FCS.",
      "highlights": [
        "Design and implementation of OCR algorithms required for automatic categorization of faxes."
      ]
    },
    {
      "company": "Experian’s Decision Analytics Global Business Unit",
      "position": "Software Engineering Manager",
      "startDate": "2004-08-01",
      "endDate": "2007-12-01",
      "summary": "Responsible for a multi-national team of 10 developers and 7 credit bureau analysts, with responsibility for FCRA compliant software development projects delivered to global financial companies (e.g. Washington Mutual, Capital One, Bank of America, Providian, HSBC).",
      "highlights": [
        "Hired and managed development staff locally and in Santiago, Chile.",
        "Infused strong development methodologies into the team to limit risk in developing applications that, in production, handle highly sensitive, highly regulated consumer credit information.",
        "Represented Experian as a technical SME in on-site customer kick-off meetings for major projects, such as Capital One and Pacific Capital Bank.",
        "Managed and contributed to projects through the full software development life-cycle from requirements extraction through the hand-off into ongoing maintenance."
      ]
    },
    {
      "company": "Experian-Scorex",
      "position": "Software Engineering Lead",
      "startDate": "2000-07-01",
      "endDate": "2004-08-01",
      "summary": "Team Lead responsible for development of C++ and C# components, as well as implementation of best practices across the team.",
      "highlights": [
        "Designed and developed numerous C++ components to extend the functionality of client systems under both Windows 2000 and AIX Unix.",
        "Standardized development practices for the team and managed resource allocation for ongoing and upcoming projects."
      ]
    },
    {
      "company": "Routech",
      "position": "Software Engineer",
      "startDate": "1998-07-01",
      "endDate": "2000-07-01",
      "summary": "Application development for high-end engineering software intended to auto-route printed circuit boards.",
      "highlights": [
        "Made core design and development contributions to the final product, working primarily in C++, following object oriented design principles. I was given wide responsibility for algorithm development (and implementation) of some of the key challenges of this project."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Texas at Dallas",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "1995-08-01",
      "endDate": "1998-05-01",
      "courses": [
      ]
    }
  ],
  "awards": [
  ],
  "publications": [
    {
      "name": "Wide Teams Podcast",
      "releaseDate": "2013-10-23",
      "website": "http://www.wideteams.com/2013/10/23/episode-100-warren-wright/"
    }
  ],
  "skills": [
    {
      "name": "Agile Methodologies",
      "keywords": [
        "agile",
        "scrum"
      ]
    },
    {
      "name": "Technical Focus",
      "keywords": [
        "elastic",
        "rabbitMQ",
        "Docker",
        "Ruby on Rails",
        "MySql"
      ]
    },
    {
      "name": "Technical Leadership",
      "keywords": [
        "design",
        "architecture",
        "production support"
      ]
    },
    {
      "name": "Team Creation/Management",
      "keywords": [
        "hiring",
        "employee development",
        "conflict resolution"
      ]
    }
  ],
  "languages": [
  ],
  "interests": [
  ],
  "references": [
    {
      "name": "Jose Martinez, Tech Lead, Stella & Dot Family of Brands",
      "reference": "Warren is the kind of leader that engineering teams dream of. He's a champion of intelligent and flexible designs, who is in touch with the technical details and with his individual players, who challenges his teams to stretch and to be agile, and prioritizes individual growth and development, while giving his team space to self manage, explore their creativity, and truly thrive. I was privileged to report directly to Warren; I grew quickly under his leadership, and our team successfully navigated our biggest challenges with him at the helm. In a senior leaderships role, Warren has so much to offer to any organization lucky enough to have him, and I look forward to the opportunity to work with him again."
    }
  ]
}
